---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCRange.#ctor(Autodesk.Revit.DB.IFC.IFCRange)
source: html/bf91ad60-3e1b-771d-05bb-2b208ad2a596.htm
---
# Autodesk.Revit.DB.IFC.IFCRange.#ctor Method

Instantiates an IFCRange object by copy.

## Syntax (C#)
```csharp
public IFCRange(
	IFCRange from
)
```

## Parameters
- **from** (`Autodesk.Revit.DB.IFC.IFCRange`) - The IFCRange object.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null